# all required symbols
# print("\u25CF \u250C \u2500 \u2510 \u2502 \u2514 \u2518")

# ● ┌ ─ ┐ │ └ ┘
import random
dice = {
    1: (
"┌ ─ ─ ─ ─ ─ ─ ┐",
"│             │",
"|             │",
"|      ●      │",
"|             │",
"|             │",
"└ ─ ─ ─ ─ ─ ─ ┘"
),
    2: (
"┌ ─ ─ ─ ─ ─ ─ ┐",
"│             │",
"|   ●         │",
"|             │",
"|        ●    │",
"|             │",
"└ ─ ─ ─ ─ ─ ─ ┘"
),
    3: (
"┌ ─ ─ ─ ─ ─ ─ ┐",
"│      ●      │",
"|             │",
"|      ●      │",
"|             │",
"|      ●      │",
"└ ─ ─ ─ ─ ─ ─ ┘"
),
    4: (
"┌ ─ ─ ─ ─ ─ ─ ┐",
"│             │",
"|   ●     ●   │",
"|             │",
"|   ●     ●   │",
"|             │",
"└ ─ ─ ─ ─ ─ ─ ┘"
),
    5: (
"┌ ─ ─ ─ ─ ─ ─ ┐",
"│             │",
"|   ●     ●   │",
"|      ●      │",
"|   ●     ●   │",
"|             │",
"└ ─ ─ ─ ─ ─ ─ ┘"
),
    6: (
"┌ ─ ─ ─ ─ ─ ─ ┐",
"│             │",
"|    ●   ●    │",
"|    ●   ●    │",
"|    ●   ●    │",
"|             │",
"└ ─ ─ ─ ─ ─ ─ ┘"
)
}

# print(dice[1][0])
number_of_dice = int(input("Enter the no. of dice u want:\t"))
dice_choices = []
total = 0
for i in range(0, number_of_dice):
    dieToShow = random.randint(1,6)
    dice_choices.append(dieToShow)
    total+= dieToShow
for lines in range(0,7):
    for die in dice_choices:
        print(dice[die][lines], end="\t")
    print()

print(f"Total: {total}")